{
    "url": "http://www.ncbi.nlm.nih.gov/pubmed/17094172",
    "docname": "17094172",
    "paragraphs": "Effects of water extract of Hibiscus sabdariffa, Linn (Malvaceae) 'Roselle' on excretion of a diclofenac formulation - PubMed This site needs JavaScript to work properly. Please enable it to take advantage of the complete set of features! Clipboard, Search History, and several other advanced features are temporarily unavailable. Skip to main page content An official website of the United States government Here's how you know The .gov means it’s official. Federal government websites often end in .gov or .mil. Before sharing sensitive information, make sure you’re on a federal government site. The site is secure. The https:// ensures that you are connecting to the official website and that any information you provide is encrypted and transmitted securely. Log in Show account info Close Account Logged in as: username Dashboard Publications Account settings Log out Access keys NCBI Homepage MyNCBI Homepage Main Content Main Navigation Search: Search Advanced Clipboard User Guide Save Email Send to Clipboard My BibliographyCollectionsCitation manager Display options Display options Format Abstract PubMed PMID Save citation to file Format: Summary (text) PubMed PMID Abstract (text) CSV Create file Cancel Email citation Subject: 1 selected item: 17094172 - PubMed To: From: Format: Summary Summary (text) Abstract Abstract (text) MeSH and other data Send email Cancel Add to Collections Create a new collection Add to an existing collection Name your collection: Name must be less than 100 characters Choose a collection: Unable to load your collection due to an error Please try again Add Cancel Add to My Bibliography My Bibliography Unable to load your delegates due to an error Please try again Add Cancel Your saved search Name of saved search: Search terms: Test search terms Would you like email updates of new search results? Saved Search Alert Radio Buttons Yes No Email: (change) Frequency: Monthly Weekly Daily Which day? The first Sunday The first Monday The first Tuesday The first Wednesday The first Thursday The first Friday The first Saturday The first day The first weekday Which day? Sunday Monday Tuesday Wednesday Thursday Friday Saturday Report format: Summary Summary (text) Abstract Abstract (text) PubMed Send at most: 1 item 5 items 10 items 20 items 50 items 100 items 200 items Send even when there aren't any new results Optional text in email: Save Cancel Create a file for external citation management software Create file Cancel Your RSS Feed Name of RSS Feed: Number of items displayed: 5 10 15 20 50 100 Create RSS Cancel RSS Link Copy Full text links Wiley Full text links ActionsCiteCollectionsAdd to CollectionsCreate a new collectionAdd to an existing collection Name your collection: Name must be less than 100 characters Choose a collection: Unable to load your collection due to an errorPlease try again Add Cancel Display options Display options Format AbstractPubMedPMID Share Permalink Copy Page navigation Title & authors Abstract Similar articles Cited by Publication types MeSH terms Substances Related information LinkOut - more resources Title & authors Abstract Similar articles Cited by Publication types MeSH terms Substances Related information LinkOut - more resources Randomized Controlled Trial Phytother Res Actions Search in PubMed Search in NLM Catalog Add to Search . 2007 Jan;21(1):96-8. doi: 10.1002/ptr.2019. Effects of water extract of Hibiscus sabdariffa, Linn (Malvaceae) 'Roselle' on excretion of a diclofenac formulation T O Fakeye 1 , A O Adegoke, O C Omoyeni, A A Famakinde Affiliations Expand Affiliation 1 Department of Clinical Pharmacy and Pharmacy Administration, Faculty of Pharmacy, University of Ibadan, Nigeria. titifakeye@yahoo.com PMID: 17094172 DOI: 10.1002/ptr.2019 Item in Clipboard Randomized Controlled Trial Effects of water extract of Hibiscus sabdariffa, Linn (Malvaceae) 'Roselle' on excretion of a diclofenac formulation T O Fakeye et al. Phytother Res. 2007 Jan. Show details Display options Display options Format Abstract PubMed PMID Phytother Res Actions Search in PubMed Search in NLM Catalog Add to Search . 2007 Jan;21(1):96-8. doi: 10.1002/ptr.2019. Authors T O Fakeye 1 , A O Adegoke, O C Omoyeni, A A Famakinde Affiliation 1 Department of Clinical Pharmacy and Pharmacy Administration, Faculty of Pharmacy, University of Ibadan, Nigeria. titifakeye@yahoo.com PMID: 17094172 DOI: 10.1002/ptr.2019 Item in Clipboard Full text links CiteDisplay options Display options Format AbstractPubMedPMID Abstract The effect of beverages prepared from the dried calyx of the flowers of Hibiscus sabdariffa on the excretion of diclofenac was investigated using a controlled study in healthy human volunteers. A high pressure liquid chromatographic method was used to analyse the 8 h urine samples collected after the administration of diclofenac with 300 mL (equivalent to 8.18 mg anthocyanins) of the beverage administered daily for 3 days. An unpaired two-tailed t-test was used to analyse for significant difference observed in the amount of diclofenac excreted before and after administration of the beverage. There was a reduction in the amount of diclofenac excreted and the wide variability observed in the control with the water beverage of Hibiscus sabdariffa (p < 0.05). There is an increasing need to counsel patients against the use of plant beverages with drugs. PubMed Disclaimer Similar articles Uricosuric effect of Roselle (Hibiscus sabdariffa) in normal and renal-stone former subjects. Prasongwatana V, Woottisin S, Sriboonlue P, Kukongviriyapan V. Prasongwatana V, et al. J Ethnopharmacol. 2008 May 22;117(3):491-5. doi: 10.1016/j.jep.2008.02.036. Epub 2008 Mar 14. J Ethnopharmacol. 2008. PMID: 18423919 Dose-dependent changes in some haematological parameters during short-term administration of Hibiscus sabdariffa Calyx aqueous extract (Zobo) in Wistar albino rats. Adigun MO, Ogundipe OD, Anetor JI, Odetunde AO. Adigun MO, et al. Afr J Med Med Sci. 2006 Mar;35(1):73-7. Afr J Med Med Sci. 2006. PMID: 17209331 Anxiolytic and sedative effects of extracts of Hibiscus sabdariffa Linn (family Malvaceae). Fakeye TO, Pal A, Khanuja SP. Fakeye TO, et al. Afr J Med Med Sci. 2008 Mar;37(1):49-54. Afr J Med Med Sci. 2008. PMID: 18756855 Phytochemical, pharmacological and toxicological aspects of Hibiscus sabdariffa L.: a review. Ali BH, Al Wabel N, Blunden G. Ali BH, et al. Phytother Res. 2005 May;19(5):369-75. doi: 10.1002/ptr.1628. Phytother Res. 2005. PMID: 16106391 Review. Hibiscus sabdariffa L. - a phytochemical and pharmacological review. Da-Costa-Rocha I, Bonnlaender B, Sievers H, Pischel I, Heinrich M. Da-Costa-Rocha I, et al. Food Chem. 2014 Dec 15;165:424-43. doi: 10.1016/j.foodchem.2014.05.002. Epub 2014 May 27. Food Chem. 2014. PMID: 25038696 Review. See all similar articles Cited by The Impact of Oxidative Stress on Pediatrics Syndromes. Micangeli G, Menghi M, Profeta G, Tarani F, Mariani A, Petrella C, Barbato C, Ferraguti G, Ceccanti M, Tarani L, Fiore M. Micangeli G, et al. Antioxidants (Basel). 2022 Oct 5;11(10):1983. doi: 10.3390/antiox11101983. Antioxidants (Basel). 2022. PMID: 36290706 Free PMC article. Review. Oxidative Stress-Related Susceptibility to Aneurysm in Marfan's Syndrome. Rysz J, Gluba-Brzózka A, Rokicki R, Franczyk B. Rysz J, et al. Biomedicines. 2021 Sep 6;9(9):1171. doi: 10.3390/biomedicines9091171. Biomedicines. 2021. PMID: 34572356 Free PMC article. Review. Infusion of Hibiscus sabdariffa L. Modulates Oxidative Stress in Patients with Marfan Syndrome. Soto ME, Zuñiga-Muñoz A, Guarner Lans V, Duran-Hernández EJ, Pérez-Torres I. Soto ME, et al. Mediators Inflamm. 2016;2016:8625203. doi: 10.1155/2016/8625203. Epub 2016 Jun 16. Mediators Inflamm. 2016. PMID: 27413258 Free PMC article. In vitro inhibitory activities of the extract of Hibiscus sabdariffa L. (family Malvaceae) on selected cytochrome P450 isoforms. Johnson SS, Oyelola FT, Ari T, Juho H. Johnson SS, et al. Afr J Tradit Complement Altern Med. 2013 Apr 12;10(3):533-40. eCollection 2013. Afr J Tradit Complement Altern Med. 2013. PMID: 24146485 Free PMC article. Publication types Randomized Controlled Trial Actions Search in PubMed Search in MeSH Add to Search MeSH terms Adult Actions Search in PubMed Search in MeSH Add to Search Anti-Inflammatory Agents, Non-Steroidal / pharmacokinetics* Actions Search in PubMed Search in MeSH Add to Search Anti-Inflammatory Agents, Non-Steroidal / urine Actions Search in PubMed Search in MeSH Add to Search Beverages Actions Search in PubMed Search in MeSH Add to Search Cross-Over Studies Actions Search in PubMed Search in MeSH Add to Search Diclofenac / pharmacokinetics* Actions Search in PubMed Search in MeSH Add to Search Diclofenac / urine Actions Search in PubMed Search in MeSH Add to Search Female Actions Search in PubMed Search in MeSH Add to Search Flowers Actions Search in PubMed Search in MeSH Add to Search Food-Drug Interactions* Actions Search in PubMed Search in MeSH Add to Search Hibiscus* Actions Search in PubMed Search in MeSH Add to Search Humans Actions Search in PubMed Search in MeSH Add to Search Kidney / drug effects* Actions Search in PubMed Search in MeSH Add to Search Kidney / metabolism Actions Search in PubMed Search in MeSH Add to Search Male Actions Search in PubMed Search in MeSH Add to Search Phytotherapy* Actions Search in PubMed Search in MeSH Add to Search Plant Extracts / administration & dosage Actions Search in PubMed Search in MeSH Add to Search Plant Extracts / pharmacology* Actions Search in PubMed Search in MeSH Add to Search Plant Extracts / therapeutic use Actions Search in PubMed Search in MeSH Add to Search Substances Anti-Inflammatory Agents, Non-Steroidal Actions Search in PubMed Search in MeSH Add to Search Plant Extracts Actions Search in PubMed Search in MeSH Add to Search Diclofenac Actions Search in PubMed Search in MeSH Add to Search Related information Cited in Books PubChem Compound PubChem Compound (MeSH Keyword) PubChem Substance LinkOut - more resources Full Text Sources Ovid Technologies, Inc. Wiley Other Literature Sources The Lens - Patent Citations Medical MedlinePlus Health Information Full text links [x] Wiley [x] Cite Copy Download .nbib .nbib Format: AMA APA MLA NLM Send To Clipboard Email Save My Bibliography Collections Citation Manager [x] NCBI Literature Resources MeSH PMC Bookshelf Disclaimer The PubMed wordmark and PubMed logo are registered trademarks of the U.S. Department of Health and Human Services (HHS). Unauthorized use of these marks is strictly prohibited. Follow NCBI Twitter Facebook LinkedIn GitHub Connect with NLM Twitter SM-Facebook SM-Youtube National Library of Medicine 8600 Rockville Pike Bethesda, MD 20894 Web Policies FOIA HHS Vulnerability Disclosure Help Accessibility Careers NLM NIH HHS USA.gov"
}